a = int(input())
x = a // 10
y = a % 10
a = y*10+x
print(a)
_____________________________________

x1 = int(input())
y1 = int(input())
x2 = int(input())
y2 = int(input())
x3 = int(input())
y3 = int(input())
f = (x1,y1)
g = (x2,y2)
h = (x3,y3)

a = (((x2-x1)**2)+((y2-y1)**2))
b = (((x3-x2)**2)+((y3-y2)**2))
c = (((x3-x1)**2)+((y3-y1)**2))

P = a+b+c
p = P/2
S = (p*(p-a)*(p-b)*(p-c))

_______________________________________________

a = int(input())
print('число десятков:', a//10)
print('число единиц:', a%10)
________________________________________________















